# 关键词匹配强制路由
ROUTER_KWORDS = [
        # 故障/告警类关键词
        "告警", "报警", "故障", "报错", "错误", "异常", "跳闸", "无法启动", "不能运行", "启动失败", "停止运行", "原因", "现象"

        # 查找文档类关键词
        "说明书", "使用说明", "手册", "技术文档", "资料", "配置参数", "参数解释", "参数说明", "调试方法",

        # 问询操作类关键词
        "解决", "检查", "处理", "如何操作", "操作步骤", "排查", "调试",

        # 编号类关键词（模糊判断）
        "故障码", "报警码", "报错信息", "故障编号", "报警编号", "故障代码", "告警代码",

        # 设备类 + 报警组合匹配的关键词（可用于后续优化组合判断）
        "GD", "CHV", "变频器", "PLC", "HMI", "高压", "中压", "低压", "伺服"
    
        # 功能类学术关键词
        "主从", "旁路柜", "永磁", "电抗器"
]

